<?php

$img_path="../img/";
$goshuin_img_path=$img_path."goshuin/";
$shrine_img_path=$img_path."shrine/";
$css_path="../css/";
$js_path="../js/";
$title="双馬の御朱印日記";
$keyword="双馬の御朱印日記,御朱印,寺社,神社,寺院,全国一宮,別表神社,官国幣社";
$description="御朱印まとめ,全国一宮,二宮,三宮,奉幣二十二社,官国幣社,別表神社,各宗派本山,各信仰総本社,世界遺産,坂東三十三箇所,西国三十三箇所,東京五社,東京十社,南都七大寺,鎌倉五山,京都五山,東国三社,西国三社,出羽三山,上毛三山,秩父三山,日本三大稲荷,日本三大八幡,日本三大天神,日本三大住吉,日本三大熊野,日本三大弁天,天下三戒壇,日本三大仏,日本三大観音,日本三大聖天,日本三大不動,天台宗十大宗派総本山,天台宗四大本山,天台宗五大門跡寺院,真言宗十八本山,真言宗智山派大本山,浄土宗七大本山,浄土真宗五大本山,日蓮宗七大本山,臨済宗九大本山,曹洞宗三本山,建武中興十五社,全国東照宮,全国護國神社,全国総社,全国国分寺,鎌倉四寺,四寺廻廊,三英傑,四大東照宮,尾張五社,茨城十二社,浅草七福神,日本七大稲荷,関東三大稲荷,東京三大稲荷,東海三大稲荷,関東三大天神,江戸三大天神,関東三大不動,関東厄除け三不動,関東三大師,関東厄除け三大師,五色不動,准勅祭十二社,平将門北斗七星,江戸三名桜,江戸三大相撲,成田山八別院,三長三本,日蓮四大法難,江戸六塔";

?>
