<?php
$hash=[
  "東京十社"=>
  [
    ["094nedu","根津神社"],
    ["000kanda","神田明神"],
    ["037kameido","亀戸天神社"],
    ["093shirayama","白山神社"],
    ["092ouji","王子神社"],

    ["064hie","日枝神社"],
    ["000shinagawa","品川神社"],
    ["077tomioka","富岡八幡宮"],
    ["063akasakahikawa","赤坂氷川神社"],
    ["059shibadai","芝大神宮"],
  ],
  "東京五社"=>
  [
    ["025meiji","明治神宮"],
    ["023yasukuni","靖国神社"],
    ["064hie","日枝神社"],
    ["022toukyou","東京大神宮"],
    ["208ookunitama","大國魂神社"],
  ],
  "日蓮宗四大本山"=>
  [
    ["233kuon","久遠寺"],
    ["131ikegami","池上本門寺"],
    ["000hokekyou","法華経寺"],
    ["160seichou","清澄寺"],
    ["162tanjou","誕生寺"],
  ],
  "南総四寺"=>
  [

  ],
  "五寺廻廊"=>
  [

  ],
  "平泉"=>
  [

  ],
  "徳川四大菩提寺"=>
  [

  ],
  "戦国菩提寺"=>
  [

  ],
  "鎌倉四寺"=>
  [

  ],
  "四大善光寺"=>
  [

  ],
  "四大東照宮"=>
  [

  ],
  "愛知十社"=>
  [

  ],
  "茨城十二社"=>
  [

  ],
  "東国一宮"=>
  [

  ],
  "世界遺産浅間神社"=>
  [

  ],
  "仙台六芒星"=>
  [

  ],
  "鎌倉五山"=>
  [

  ],
  "京都五山"=>
  [

  ],
  "浅草七福神"=>
  [

  ],
  "日光二社一寺"=>
  [

  ],
  "秩父四社"=>
  [

  ],
  "東国三社"=>
  [

  ],
  "三大弁財天"=>
  [

  ],
  "日本三大稲荷"=>
  [

  ],
  "関東三大稲荷"=>
  [

  ],
  "関東三大天神"=>
  [

  ],
  "江戸三大天神"=>
  [

  ],
  "江戸三名桜"=>
  [

  ],
  "江戸三大相撲"=>
  [

  ],
  "五色不動"=>
  [

  ],
  "関東厄除け三不動"=>
  [

  ],
  "関東三大不動"=>
  [

  ],
  "関東厄除け大師"=>
  [

  ],
  "関東三大師"=>
  [

  ],
  "三大聖天"=>
  [

  ],
  "准勅祭十二社"=>
  [

  ],
  "平将門北斗七星"=>
  [

  ],
  "三大輪王寺"=>
  [

  ],
  "日本三大仏"=>
  [

  ],
  "三長三本"=>
  [

  ],
  "箱根三社"=>
  [

  ],
  "成田山別院"=>
  [

  ],
  "日蓮四大法難"=>
  [

  ],
  "江戸六塔"=>
  [

  ],
  "浄土宗七大本山"=>
  [

  ],
  "日蓮宗七大本山"=>
  [

  ],
  "臨済宗九大本山"=>
  [

  ],
  "曹洞宗三大本山"=>
  [

  ],
  "建武中興十五社"=>
  [

  ],
  "坂東三十三箇所"=>
  [

  ],
  "全国東照宮"=>
  [

  ],
  "全国護國神社"=>
  [

  ],
  "全国総社"=>
  [

  ],
  "全国国分寺"=>
  [

  ],
];
?>
