<?php
$hash=[
  "東京十社"=>
  [
    ["094nedu","根津神社"],
    ["000kanda","神田明神"],
    ["037kameido","亀戸天神社"],
    ["093shirayama","白山神社"],
    ["092ouji","王子神社"],

    ["064hie","日枝神社"],
    ["000shinagawa","品川神社"],
    ["077tomioka","富岡八幡宮"],
    ["063akasakahikawa","赤坂氷川神社"],
    ["059shibadai","芝大神宮"],
  ],


  "東京五社"=>
  [
    ["025meiji","明治神宮"],
    ["023yasukuni","靖国神社"],
    ["064hie","日枝神社"],
    ["022toukyou","東京大神宮"],
    ["208ookunitama","大國魂神社"],
  ],


  "日蓮宗四大本山"=>
  [
    ["233kuon","久遠寺"],
    ["131ikegami","池上本門寺"],
    ["000hokekyou","法華経寺"],
    ["160seichou","清澄寺"],
    ["162tanjou","誕生寺"],
  ],


  "南総四寺"=>
  [
    ["153kasamori","笠森寺"],
    ["154nihon","日本寺"],
    ["155gake","大福寺"],
    ["156nago","那古寺"],
  ],


  "五寺廻廊"=>
  [
    ["182chuuson","中尊寺"],
    ["186moutsuu","毛越寺"],
    ["178zuigan","瑞巌寺"],
    ["177entsuu","円通院"],
    ["000","立石寺"],
  ],


  "平泉"=>
  [
    ["184hiraizumishirayama","平泉寺"],
    ["182chuuson","中尊寺"],
    ["183konjiki","金色堂"],
    ["186moutsuu","毛越寺"],
    ["185gikei","義経堂"],
  ],


  "徳川四大菩提寺"=>
  [
    ["000kanei","寛永寺"],
    ["060zoujou","増上寺"],
    ["107daijuu","大樹寺"],
    ["119kougetsu","高月院"],
  ],


  "戦国菩提寺"=>
  [
    ["102banshou","萬松寺"],
    ["245erin","恵林寺"],
    ["260rinsen","林泉寺"],
    ["000","早雲寺"],
  ],


  "鎌倉四寺"=>
  [
    ["040kenchou","建長寺"],
    ["041engaku","円覚寺"],
    ["199shoujoukou","清浄光寺"],
    ["000","光明寺"],
  ],


  "四大善光寺"=>
  [
    ["001zenkou","善光寺"],
    ["244kaizenkou","甲斐善光寺"],
    ["000","元善光寺"],
    ["116toukaizenkou","東海善光寺"],
  ],


  "四大東照宮"=>
  [
    ["087nikkou","日光東照宮"],
    ["229kunousan","久能山東照宮"],
    ["018ueno","上野東照宮"],
    ["061shiba","芝東照宮"],
  ],


  "愛知十社"=>
  [
    ["114masumita","真清田神社"],
    ["104ooagata","大縣神社"],
    ["027atsuta","熱田神宮"],
    ["115oomiwa","大神神社"],
    ["113kou","大国霊神社"],

    ["110toga","砥鹿神社"],
    ["111chiryuu","知立神社"],
    ["117sanage","猿投神社"],
    ["112tsushima","津島神社"],
    ["106haritsuna","針綱神社"],
  ],


  "茨城十二社"=>
  [
    ["071kashima","鹿島神宮"],
    ["084ooarai","大洗磯前神社"],
    ["145sakatsura","酒列磯前神社"],
    ["082kasama","笠間稲荷神社"],

    ["081tsukubasan","筑波山神社"],
    ["096oosugi","大杉神社"],
    ["083ibarakiken","茨城縣護国神社"],
    ["151hitachi","常陸國總社宮"],

    ["147mitohachiman","水戸八幡宮"],
    ["148mitotou","水戸東照宮"],
    ["149tokiwa","常磐神社"],
    ["146mitoyoshida","吉田神社"],
  ],


  "東国一宮"=>
  [

  ],


  "世界遺産浅間神社"=>
  [
    ["",""],
    ["",""],
    ["",""],
    ["",""],

    ["",""],
    ["",""],
    ["",""],
    ["",""],
  ],


  "仙台六芒星"=>
  [
    ["",""],
    ["",""],
    ["",""],

    ["",""],
    ["",""],
    ["",""],
  ],


  "鎌倉五山"=>
  [
    ["",""],
    ["",""],
    ["",""],
    ["",""],
    ["",""],
  ],


  "京都五山"=>
  [
    ["",""],
    ["",""],
    ["",""],
    ["",""],
    ["",""],
  ],


  "浅草七福神"=>
  [
    ["",""],
    ["",""],
    ["",""],
    ["",""],

    ["",""],
    ["",""],
    ["",""],
  ],


  "日光二社一寺"=>
  [
    ["",""],
    ["",""],
    ["",""],
    ["",""],
    ["",""],
  ],


  "秩父四社"=>
  [
    ["",""],
    ["",""],
    ["",""],
    ["",""],
  ],


  "東国三社"=>
  [
    ["",""],
    ["",""],
    ["",""],
  ],


  "三大弁財天"=>
  [
    ["",""],
    ["",""],
    ["",""],
  ],


  "日本三大稲荷"=>
  [
    ["",""],
    ["",""],
    ["",""],
    ["",""],
    ["",""],
  ],


  "関東三大稲荷"=>
  [
    ["",""],
    ["",""],
    ["",""],
  ],


  "関東三大天神"=>
  [
    ["",""],
    ["",""],
    ["",""],
  ],


  "江戸三大天神"=>
  [
    ["",""],
    ["",""],
    ["",""],
  ],


  "江戸三名桜"=>
  [
    ["",""],
    ["",""],
    ["",""],
  ],


  "江戸三大相撲"=>
  [
    ["",""],
    ["",""],
    ["",""],
  ],


  "五色不動"=>
  [
    ["",""],
    ["",""],
    ["",""],

    ["",""],
    ["",""],
    ["",""],
  ],


  "関東厄除け三不動"=>
  [
    ["",""],
    ["",""],
    ["",""],
  ],


  "関東三大不動"=>
  [
    ["",""],
    ["",""],
    ["",""],
  ],


  "関東厄除け大師"=>
  [
    ["",""],
    ["",""],
    ["",""],
    ["",""],
  ],


  "関東三大師"=>
  [
    ["",""],
    ["",""],
    ["",""],

    ["",""],
    ["",""],
    ["",""],
  ],


  "三大聖天"=>
  [

  ],


  "准勅祭十二社"=>
  [

  ],


  "平将門北斗七星"=>
  [

  ],


  "三大輪王寺"=>
  [

  ],


  "日本三大仏"=>
  [

  ],


  "三長三本"=>
  [

  ],


  "箱根三社"=>
  [

  ],


  "成田山別院"=>
  [

  ],


  "日蓮四大法難"=>
  [

  ],


  "江戸六塔"=>
  [

  ],


  "浄土宗七大本山"=>
  [

  ],


  "日蓮宗七大本山"=>
  [

  ],


  "臨済宗九大本山"=>
  [

  ],


  "曹洞宗三大本山"=>
  [

  ],


  "建武中興十五社"=>
  [

  ],


  "坂東三十三箇所"=>
  [

  ],


  "全国東照宮"=>
  [

  ],


  "全国護國神社"=>
  [

  ],


  "全国総社"=>
  [

  ],


  "全国国分寺"=>
  [

  ],
];
?>
