<?php
$all_group=[
  "東京五社"=>
  [
    ["025meiji","明治神宮"],
    ["023yasukuni","靖国神社"],
    ["064hie","日枝神社"],
    ["022toukyoudai","東京大神宮"],
    ["208ookunitama","大國魂神社"],
  ],


  "東京十社"=>
  [
    ["094nedu","根津神社"],
    ["000kanda","神田明神"],
    ["037kameido","亀戸天神社"],
    ["093shirayama","白山神社"],
    ["092ouji","王子神社"],

    ["064hie","日枝神社"],
    ["000shinagawa","品川神社"],
    ["077tomioka","富岡八幡宮"],
    ["063akasakahikawa","赤坂氷川神社"],
    ["059shibadai","芝大神宮"],
  ],


  "日蓮宗総本山＋四大本山"=>
  [
    ["233kuon","総本山<br>久遠寺"],
    ["131ikegami","大本山<br>池上本門寺"],
    ["000hokekyou","大本山<br>法華経寺"],
    ["160seichou","大本山<br>清澄寺"],
    ["162tanjou","大本山<br>誕生寺"],
  ],


  "南総五寺"=>
  [
    ["153kasamori","笠森寺"],
    ["154nihon","日本寺"],
    ["155gake","大福寺"],
    ["156nago","那古寺"],
    ["360inubouzaki","満願寺"],
  ],


  "四寺廻廊"=>
  [
    ["183konjiki","中尊寺"],
    ["186moutsuu","毛越寺"],
    ["178zuigan","瑞巌寺"],
    ["177entsuu","円通院"],
    ["risshaku","立石寺"],
  ],

  "徳川四大菩提寺"=>
  [
    ["000kanei","寛永寺"],
    ["060zoujou","増上寺"],
    ["107daijuu","大樹寺"],
    ["119kougetsu","高月院"],
  ],

  "戦国菩提寺"=>
  [
    ["102banshou","織田氏<br>萬松寺"],
    ["245erin","武田氏<br>恵林寺"],
    ["260rinsen","上杉氏<br>林泉寺"],
    ["000","北条氏<br>早雲寺"],
  ],

  "三英傑神社"=>
  [
    ["429takeisao","織田信長<br>建勲神社"],
    ["402toyokuni","豊臣秀吉<br>豊国神社"],
    ["087nikkou","徳川家康<br>東照宮"],
  ],


  "鎌倉四寺"=>
  [
    ["040kenchou","建長寺"],
    ["041engaku","円覚寺"],
    ["199shoujoukou","清浄光寺"],
    ["koumyou","光明寺"],
  ],


  "四大東照宮"=>
  [
    ["087nikkou","日光東照宮"],
    ["229kunousan","久能山東照宮"],
    ["018ueno","上野東照宮"],
    ["061shiba","芝東照宮"],
  ],

  "尾張五社"=>
  [
    ["114masumita","尾張国一宮<br>真清田神社"],
    ["104ooagata","尾張国二宮<br>大縣神社"],
    ["027atsuta","尾張国三宮<br>熱田神宮"],
    ["115oomiwa","尾張国凖一宮<br>大神神社"],
    ["113kou","尾張国総社<br>大国霊神社"],
    ["112tsushima","天王総本宮<br>津島神社"],
    ["106haritsuna","尾張五社<br>針綱神社"],
    ["chiyoboinari","尾張五社<br>千代保稲荷神社"],
  ],


  "茨城十二社"=>
  [
    ["071kashima","鹿島神宮"],
    ["084ooarai","大洗磯前神社"],
    ["145sakatsura","酒列磯前神社"],
    ["082kasama","笠間稲荷神社"],

    ["081tsukubasan","筑波山神社"],
    ["356oosugi","大杉神社"],
    ["083ibarakigokoku","茨城縣護国神社"],
    ["151hitachi","常陸國總社宮"],

    ["147mitohachiman","水戸八幡宮"],
    ["148mitotou","水戸東照宮"],
    ["149tokiwa","常磐神社"],
    ["146mitoyoshida","吉田神社"],
  ],

  "伊勢神宮正宮別宮"=>[
    ["363isekoutai","内宮<br>皇大神宮"],
    ["369isetoyouke","外宮<br>豊受大神宮"],
    ["361isetsukiyomi","別宮<br>月讀宮"],
    ["368isetsukiyomi","別宮<br>月夜見宮"],

    ["yamatohime","別宮<br>倭姫宮"],
    ["364iseizawa","別宮<br>伊雑宮"],
    ["takihara","別宮<br>瀧原宮"],
  ],

  "世界遺産（熊野）"=>
  [
    ["374kumanohonguu","熊野本宮大社"],
    ["373kumanohayatama","熊野速玉大社"],
    ["370kumanonachi","熊野那智大社"],
    ["371seiganto","青岸渡寺"],
    ["372fudarakusan","補陀洛山寺"],
  ],


  "世界遺産（高野山）"=>
  [
    ["379kongoubu","金剛峯寺"],
    ["378kongouzanmai","金剛三昧院"],
    ["375jison","慈尊院"],
    ["377niutsuhime","丹生都比売神社"],
    ["376niukanshoufu","丹生官省符神社"],
  ],


  "世界遺産（吉野）"=>
  [
    //["yoshino","吉野神宮"],
    ["yoshinomikumari","吉野水分神社"],
    ["yoshimizu","吉水神社"],
    ["oominesan","大峰山寺"],
    ["kimpusen","金峯山寺"],
    ["kimpu","金峯神社"],
  ],


  "世界遺産（富士山）"=>
  [
    ["231sengen","浅間大社"],
    ["234yamamiyasengen","山宮浅間神社"],
    ["235murayamasengen","村山浅間神社"],
    ["236suyamasengen","須山浅間神社"],

    ["237higashiguchisengen","東口本宮浅間神社"],
    ["238kitaguchisengen","北口本宮浅間神社"],
    ["239mimurosengen","冨士御室浅間神社"],
    ["240kawaguchisengen","河口浅間神社"],
  ],

  "世界遺産（日光）"=>
  [
    ["087nikkou","日光東照宮"],
    ["086rinnou","日光輪王寺"],
    ["088nikkoufutarasan","日光二荒山神社"],
    ["089daiyuu","大猷院"],
    ["090daiyuuinkinkaku","金閣殿"],
  ],

  "世界遺産（平泉）"=>
  [
    ["184hiraizumishirayama","平泉白山神社"],
    ["182chuuson","中尊寺"],
    ["183konjiki","金色堂"],
    ["186moutsuu","毛越寺"],
    ["185gikei","義経堂"],
  ],

  "世界遺産（京都）"=>
  [
    ["445kamigamo","賀茂別雷神社"],
    ["420shimogamo","賀茂御祖神社"],
    ["006touji","教王護国寺"],
    ["406kiyomizu","清水寺"],
    ["enryaku","延暦寺"],

    ["461daigo","醍醐寺"],
    ["437ninna","仁和寺"],
    ["459byoudou","平等院"],
    ["458ujikami","宇治上神社"],
    ["kouzan","高山寺"],

    ["saihou","西芳寺"],
    ["009tenryuu","天龍寺"],
    ["430rokuon","鹿苑寺"],
    ["423jishou","慈照寺"],
    ["436ryouan","龍安寺"],

    ["462sampou","三宝院"],
  ],

  "世界遺産（奈良）"=>
  [
    ["houryuu","法隆寺"],
    ["hokki","法起寺"],
    ["toudai","東大寺"],
    ["koufuku","興福寺"],
    ["392kasuga","春日大社"],

    ["gangou","元興寺"],
    ["yakushi","薬師寺"],
    ["toushoudai","唐招提寺"],
  ],

  "世界遺産（各地）"=>
  [
    ["702munakata","宗像大社"],
    ["667itsukushima","厳島神社"],
    ["sahimeyama","佐毘売山神社"],
    ["iwamirakan","石見羅漢寺"],
  ],

  "仙台六芒星"=>
  [
    ["167oosaki","大崎八幡宮"],
    ["170tsutsujigaoka","榴岡天満宮"],
    ["171sendaitou","仙台東照宮"],

    ["191miyagigokoku","宮城縣護國神社"],
    ["172aoba","青葉神社"],
    ["169sendaiatago","愛宕神社"],
  ],

  "南都七大寺"=>
  [
    ["toudai","東大寺"],
    ["koufuku","興福寺"],
    ["gangou","元興寺"],
    ["daian","大安寺"],
    ["saidai","西大寺"],
    ["yakushi","薬師寺"],
    ["houryuu","法隆寺"],
    ["toushoudai","唐招提寺"],
  ],

  "南都十五大寺"=>
  [
    ["717shitennou","四天王寺"],
    ["gufuku","弘福寺(川原寺)"],
    ["006touji","東寺"],
    ["asuka","飛鳥寺(本元興寺)"],
    ["shinyakushi","新薬師寺"],
    //西寺
    //崇福寺
  ],

  "鎌倉五山"=>
  [
    ["040kenchou","建長寺"],
    ["041engaku","円覚寺"],
    ["046jufuku","寿福寺"],
    ["042jouchi","浄智寺"],
    ["045joumyou","浄妙寺"],
  ],

  "京都五山"=>
  [
    ["009tenryuu","天龍寺"],
    ["shoukoku","相国寺"],
    ["409kennin","建仁寺"],
    ["399toufuku","東福寺"],
    ["400manju","万寿寺"],
  ],


  "四大善光寺"=>
  [
    ["001zenkou","善光寺"],
    ["244kaizenkou","甲斐善光寺"],
    ["motozenkou","元善光寺"],
    ["116toukaizenkou","東海善光寺"],
  ],


  "浅草七福神"=>
  [
    ["035sensou","浅草寺"],
    ["036asakusa","浅草神社"],
    ["matsuchiyama","待乳山聖天"],
    ["034imado","今戸神社"],
    ["hashiba","橋場不動院"],

    ["ishihama","石浜神社"],
    ["032asakusaootori","鷲神社"],
    ["033yoshiwara","吉原神社"],
    ["029yasakiinari","矢先稲荷神社"],
  ],

  "東国三社"=>
  [
    ["071kashima","鹿島神宮"],
    ["358katori","香取神宮"],
    ["070ikisu","息栖神社"],
  ],

  "西国三社"=>
  [
    ["383hinokuma","日前神宮・国懸神宮"],
    ["384kamayama","竈山神社"],
    ["385itakiso","伊太祁曽神社"],
  ],

  "出羽三山"=>
  [
    ["yudonosan","湯殿山神社"],
    ["gassan","月山神社"],
    ["dewa","出羽神社"],
  ],

  "上毛三山"=>
  [
    ["610myougi","妙義神社"],
    ["614haruna","榛名神社"],
    ["621miyosawaakagi","赤城神社"],
  ],

  "秩父三山"=>
  [
    ["205chichibu","秩父神社"],
    ["204mitsumine","三峯神社"],
    ["207hodosan","寶登山神社"],
  ],

  "箱根三社"=>
  [
    ["225hakone","箱根神社"],
    ["226kuzuryuu","九頭龍神社"],
    ["000","箱根元宮"],
  ],

  "日本三大稲荷"=>
  [
    ["013fushimi","伏見稲荷大社"],
    ["yuutokuinari","祐徳稲荷神社"],
    ["082kasama","笠間稲荷神社"],
    ["643saijou","最上稲荷"],
    ["109toyokawa","豊川稲荷"],
  ],

  "日本七大稲荷神社"=>
  [
    ["013fushimi","伏見稲荷大社"],
    ["yuutokuinari","祐徳稲荷神社"],
    ["082kasama","笠間稲荷神社"],
    ["takekoma","竹駒神社"],
    ["taikodani","太鼓谷稲成神社"],

    ["shiwainari","志和稲荷神社	"],
    ["yakyuuinari","箭弓稲荷神社"],
    ["650kusadoinari","草戸稲荷神社"],
    ["091oujiinari","王子稲荷神社"],
    ["takahashiinari","高橋稲荷神社"],

    ["217kanmuri","冠稲荷神社"],
    ["tsumagoi","妻戀神社"],
  ],

  "関東三大稲荷"=>
  [
    ["082kasama","笠間稲荷神社"],
    ["shirasasainari","白笹稲荷神社"],
    ["091oujiinari","王子稲荷神社"],
    ["shouzokuinari","装束稲荷神社"],
  ],

  "東京三大稲荷"=>
  [
    ["327higashifushimi","東伏見稲荷神社"],
    ["342toyokawainari","豊川稲荷東京別院"],
    ["kasamainaritokyo","笠間稲荷神社東京別社"],
  ],

  "東海三大稲荷"=>
  [
    ["109toyokawa","豊川稲荷"],
    ["chiyoboinari","千代保稲荷神社"],
    ["sankouinari","三光稲荷神社"],
  ],

  "日本三大八幡"=>
  [
    ["usa","宇佐八幡宮"],
    ["456iwashimizuhachiman","石清水八幡宮"],
    ["698hakozaki","筥崎宮"],
    ["047tsurugaoka","鶴岡八幡宮"],
  ],

  "日本三大天神"=>
  [
    ["689dazaifu","太宰府天満宮"],
    ["434kitanotenman","北野天満宮"],
    ["672houfu","防府天満宮"],
  ],

  "関東三大天神"=>
  [
    ["019yushima","湯島天満宮"],
    ["037kameido","亀戸天神社"],
    ["209yabo","谷保天満宮"],
  ],

  "江戸三大天神"=>
  [
    ["019yushima","湯島天満宮"],
    ["037kameido","亀戸天神社"],
    ["065hirakawa","平河天満宮"],
    ["000gojou","五條天神社"],
  ],

  "日本三大住吉"=>
  [
    ["389sumiyoshi","摂津国一宮<br>住吉大社"],
    ["682shimonosekisumiyoshi","長門国一宮<br>住吉神社"],
    ["695hakatasumiyoshi","筑前国一宮<br>住吉神社"],
  ],

  "日本三大熊野"=>
  [
    ["374kumanohonguu","熊野本宮大社"],
    ["373kumanohayatama","熊野速玉大社"],
    ["370kumanonachi","熊野那智大社"],
    ["kumanokoutai","熊野皇大神社"],
    ["miyauchikumano","宮内熊野大社"],
  ],

  "日本三大愛宕"=>
  [
    ["atago","京都愛宕神社"],
    ["062toukyouatago","東京愛宕神社"],
    ["692washioatago","鷲尾愛宕神社"],
  ],

  "日本三大祗園"=>
  [
    ["410yasaka","八坂神社"],
    ["112tsushima","津島神社"],
    ["696kushida","櫛田神社"],
  ],

  "日本三大弁天"=>
  [
    ["tsukubusuma","都久夫須麻神社"],
    ["667itsukushima","厳島神社"],
    ["197enoshima","江島神社"],
  ],

  "天下三戒壇"=>
  [
    ["toudai","東大寺"],
    ["688kanzeon","観世音寺"],
    ["338shimotsukeyakushi","下野薬師寺"],
  ],

  "日本三大大仏"=>
  [
    ["toudai","奈良の大仏<br>東大寺"],
    ["050koutoku","鎌倉大仏<br>高徳院"],
    ["401houkou","京の大仏<br>方広寺"],
    ["302takaoka","高岡大仏<br>大佛寺"],
    ["000","東京大仏<br>乗蓮寺"],
  ],

  "日本三大観音"=>
  [
    ["035sensou","浅草観音"],
    ["101oosu","大須観音"],
    ["000","津観音"],
  ],

  "日本三大如来"=>
  [
    ["001zenkou","阿弥陀如来<br>善光寺"],
    ["439seiryou","釈迦如来<br>清凉寺"],
    ["byoudouji","薬師如来<br>平等寺"],
  ],

  "日本三大聖天"=>
  [
    ["218kangi","妻沼聖天<br>歓喜院"],
    ["matsuchiyama","待乳山聖天<br>本龍院"],
    ["391ikoma","生駒聖天<br>宝山寺"],
  ],

  "日本三大不動"=>
  [
    ["412shouren","青蓮院"],
    ["379kongoubu","高野山明王院"],
    ["450onjou","園城寺"],
  ],

  "関東三大不動（真言宗）"=>
  [
    ["051shinshou","成田不動尊<br>新勝寺"],
    ["210takahata","高幡不動尊<br>金剛寺"],
    ["219fudougaoka","不動ケ岡不動尊<br>總願寺"],
    ["ooyama","大山不動尊<br>大山寺"],//伊勢原
    ["123itabashi","板橋不動尊<br>願成寺"],
  ],

  "関東厄除け三不動（天台宗）"=>
  [
    ["152chibayaku","千葉厄除け不動尊<br>妙泉寺"],
    ["072meguro","目黒不動尊<br>瀧泉寺"],
    ["000","飛不動尊<br>正宝院"],
  ],

  "関東三大師（天台宗・良源）"=>
  [
    ["211sano","佐野厄除け大師<br>惣宗寺"],
    ["619aoyagi","青柳大師<br>龍蔵寺"],
    ["331kawagoetaishi","川越大師<br>喜多院"],
    // ["000","拝島大師<br>本覚院"],
    ["212ashikaga","足利厄除け大師<br>龍泉寺"],
    ["195jindai","厄除け元三大師<br>深大寺"],
  ],

  "関東厄除け三大師（真言宗・空海）"=>
  [
    ["000nishiarai","西新井大師<br>總持寺"],
    ["133kawasaki","川崎大師<br>平間寺"],
    ["357kanfuku","大師堂<br>観福寺"],
  ],

  "五色不動"=>
  [
    ["072meguro","目黒不動<br>瀧泉寺"],
    ["249mejiro","目白不動<br>金乗院"],
    ["000","目赤不動<br>南谷寺"],

    ["000","目青不動<br>教学院"],
    ["000","目黄不動<br>永久寺"],
    ["000","目黄不動<br>最勝寺"],
  ],


  "平将門北斗七星"=>
  [
    ["torikoe","鳥越神社"],
    ["121kabuto","兜神社"],
    ["000kanda","神田明神"],
    ["tsukudohachiman","築土八幡神社"],

    ["mizuinari","水稲荷神社"],
    ["000yoroi","鎧神社"],
    ["tsukudo","築土神社"],
    ["000karasumori","烏森神社"],
  ],


  "日本三大奇祭"=>
  [
    ["179kuroishi","黒石寺蘇民祭<br>黒石寺"],
    ["003suwa","御柱祭り<br>諏訪大社"],
    ["238kitaguchisengen","吉田の火祭り<br>北口本宮冨士浅間神社"],
    ["ooi","帯祭り<br>大井神社"],
    ["113kou","国府宮裸祭り<br>国府宮"],
  ],

  "日本三大霊場"=>
  [
    ["bodai","恐山<br>菩提寺"],
    ["enryaku","比叡山<br>延暦寺"],
    ["379kongoubu","高野山<br>金剛峯寺"],
  ],

  "日本三名塔"=>
  [
    ["houryuu","法隆寺"],
    ["677rurikou","瑠璃光寺"],
    ["461daigo","醍醐寺"],
    ["dewa","羽黒山五重塔"],
  ],

  "日本三大楼門"=>
  [
    ["aso","阿蘇神社"],
    ["071kashima","鹿島神宮"],
    ["698hakozaki","筥崎宮"],
  ],

  "日本三大山門"=>
  [
    ["233kuon","久遠寺"],
    ["414nanzen","南禅寺"],
    ["411chion","知恩院"],
  ],

  "日本三大名鐘"=>
  [
    ["jingo","神護寺"],
    ["450onjou","園城寺"],
    ["459byoudou","平等院"],
  ],

  "日本三大梵鐘"=>
  [
    ["411chion","知恩院"],
    ["houryuu","法隆寺"],
    ["toudai","東大寺"],
  ],


  "江戸三名桜"=>
  [
    ["192konnou","金王八幡宮"],
    ["093shirayama","白山神社"],
    ["000","円照寺"],
  ],

  "江戸三大相撲"=>
  [
    ["000setagaya","世田谷八幡宮"],
    ["193shibuyahikawa","渋谷氷川神社"],
    ["220ooikashima","大井鹿嶋神社"],
  ],


  "成田山八別院"=>
  [
    ["051shinshou","本院<br>成田山新勝寺"],
    ["078fukagawa","東京別院<br>深川不動堂"],
    ["332kawagoenarita","川越別院<br>本行院"],
    ["sapporonarita","札幌別院<br>新栄寺"],
    ["136yokohamanarita","横浜別院<br>延命院"],

    ["hakodatenarita","函館別院<br>函館寺"],
    ["oosakanarita","大阪別院<br>明王院"],
    ["105inuyamanarita","名古屋別院<br>大聖寺"],
    ["fukuinarita","福井別院<br>九頭龍寺"],
    //以下は分院、末寺の順
  ],

  "三長三本"=>
  [
    ["131ikegami","長栄山本門寺"],
    ["myouhon","長興山妙本寺"],
    ["254hondo","長谷山本土寺"],
  ],

  "日蓮四大法難"=>
  [
    ["159kyounin","小松原法難<br>鏡忍寺"],
    ["honkoku","松葉ヶ谷法難<br>本圀寺"],
    ["198ryuukuchi","龍ノ口法難<br>龍口寺"],
    ["futsugen","伊豆法難<br>佛現寺"],
  ],

  "日蓮宗五重塔"=>
  [
    ["233kuon","久遠寺"],
    ["000hokekyou","法華経寺"],
    ["232kitayamahonmon","北山本門寺"],
    ["131ikegami","池上本門寺"],

    ["198ryuukuchi","龍口寺"],
    ["296myoujou","妙成寺"],
    ["myousen","妙宣寺"],
  ],

  "江戸六塔"=>
  [
    ["000kanei","寛永寺"],
    ["060zoujou","増上寺"],
    ["035sensou","浅草寺"],

    ["131ikegami","池上本門寺"],
    ["000housen","宝仙寺"],
    ["000","天王寺"],
  ],

  // "法相宗二大別当"=>
  // [
  //   ["koufuku","大本山<br>興福寺"],
  //   ["ichijou","興福寺別当<br>一乗院"],
  //   ["daijou","興福寺別当<br>大乗院"],
  // ],

  "天台宗十大宗派総本山"=>
  [
    ["enryaku","天台宗総本山<br>延暦寺"],
    ["450onjou","天台寺門宗総本山<br>園城寺"],
    ["447saikyou","天台真盛宗総本山<br>西教寺"],
    ["421shougo","本山修験宗総本山<br>聖護院"],
    ["kimpusen","金峯山修験本宗総本山<br>金峯山寺"],

    ["koutaku","羽黒山修験本宗本山<br>荒沢寺"],
    ["717shitennou","和宗総本山<br>四天王寺"],
    ["386kokawa","粉河観音宗総本山<br>粉河寺"],
    ["kurama","鞍馬弘教総本山<br>鞍馬寺"],
    ["035sensou","聖観音宗総本山<br>浅草寺"],
  ],

  "天台宗総本山＋四大本山"=>
  [
    ["enryaku","総本山<br>延暦寺"],
    ["183konjiki","大本山<br>中尊寺"],
    ["086rinnou","大本山<br>輪王寺"],
    ["000kanei","大本山<br>寛永寺"],
    ["001zenkou","大本山<br>善光寺"],
  ],

  "天台宗五大門跡寺院"=>
  [
    ["412shouren","青蓮院"],
    ["sanzen","三千院"],
    ["403myouhou","妙法院"],
    ["manshu","曼殊院"],
    ["bishamon","毘沙門堂"],
  ],

  "真言宗十八本山"=>
  [
    ["379kongoubu","高野山真言宗総本山<br>金剛峯寺"],
    ["461daigo","真言宗醍醐派総本山<br>醍醐寺"],
    ["006touji","東寺真言宗総本山<br>東寺"],
    ["398sennyuu","真言宗泉涌寺派総本山<br>泉涌寺"],
    ["kajuu","真言宗山階派大本山<br>勧修寺"],

    ["437ninna","真言宗御室派総本山<br>仁和寺"],
    ["440daikaku","真言宗大覚寺派大本山<br>大覚寺"],
    ["zentsuu","真言宗善通寺派総本山<br>善通寺"],
    ["zuishin","真言宗善通寺派大本山<br>随心院"],
    ["405chishaku","真言宗智山派総本山<br>智積院"],

    ["sakuraihase","真言宗豊山派総本山<br>桜井長谷寺"],
    ["negoro","新義真言宗総本山<br>根来寺"],
    ["624suma","真言宗須磨寺派大本山<br>須磨寺"],
    ["chougosonshi","信貴山真言宗総本山<br>朝護孫子寺"],
    ["706kiyoshikoujinseichou","真言三宝派大本山<br>清荒神清澄寺"],

    ["707nakayamadera","真言宗中山寺派大本山<br>中山寺"],
    ["saidai","真言律宗総本山<br>西大寺"],
    ["391ikoma","真言律宗大本山<br>宝山寺"],
  ],

  "真言宗智山派大本山＋別格本山"=>
  [
    ["051shinshou","大本山<br>成田山新勝寺"],
    ["133kawasaki","大本山<br>川崎大師平間寺"],
    ["337yakuou","大本山<br>高尾山薬王院"],
    ["210takahata","別格本山<br>高幡不動金剛寺"],
    ["101oosu","別格本山<br>大須観音宝生院"],
  ],

  "浄土宗総本山＋七大本山"=>
  [
    ["411chion","総本山<br>知恩院"],
    ["060zoujou","大本山<br>増上寺"],
    ["koumyou","大本山<br>光明寺"],
    ["001zenkou","大本山<br>善光寺"],

    ["422konkaikoumyou","大本山<br>金戒光明寺"],
    ["425chionji","大本山<br>知恩寺"],
    ["419shoujouke","大本山<br>清浄華院"],
    ["zendou","大本山<br>善導寺"],
  ],

  "浄土真宗五大本山"=>
  [
    ["nishihongan","浄土真宗本願寺派本山<br>西本願寺"],
    ["higashihongan","真宗大谷派本山<br>東本願寺"],
    ["344senju","真宗高田派本山<br>専修寺"],
    ["bukkou","真宗佛光寺派本山<br>佛光寺"],
    ["koushou","真宗興正派本山<br>興正寺"],
  ],

  "日蓮宗総本山＋七大本山"=>
  [
    ["233kuon","総本山<br>久遠寺"],
    ["162tanjou","大本山<br>誕生寺"],
    ["160seichou","大本山<br>清澄寺"],
    ["000hokekyou","大本山<br>法華経寺"],

    ["232kitayamahonmon","大本山<br>北山本門寺"],
    ["131ikegami","大本山<br>池上本門寺"],
    ["427myouken","大本山<br>妙顕寺"],
    ["honkoku","大本山<br>本圀寺"],
  ],

  "臨済宗九大本山"=>
  [
    ["414nanzen","大本山<br>南禅寺"],
    ["009tenryuu","大本山<br>天龍寺"],
    ["shoukoku","大本山<br>相国寺"],
    ["409kennin","大本山<br>建仁寺"],
    ["399toufuku","大本山<br>東福寺"],

    ["431daitoku","大本山<br>大徳寺"],
    ["438myoushin","大本山<br>妙心寺"],
    ["040kenchou","大本山<br>建長寺"],
    ["041engaku","大本山<br>円覚寺"],
  ],


  "曹洞宗三本山"=>
  [
    ["285eihei","大本山<br>永平寺"],
    ["134souji","大本山<br>総持寺"],
    ["180shoubou","旧大本山<br>正法寺"],
  ],


  "建武中興十五社"=>
  [
    ["yoshino","吉野神宮"],
    ["044kamakura","鎌倉宮"],
    ["266iinoya","井伊谷宮"],
    ["yatsushiro","八代宮"],
    ["274kanegasaki","金崎宮"],

    ["097komikado","小御門神社"],
    ["kikuchi","菊池神社"],
    ["622minatogawa","湊川神社"],
    ["nawa","名和神社"],
    ["715abeno","阿倍野神社"],

    ["fujishima","藤島神社"],
    ["347yuuki","結城神社"],
    ["ryouzen","霊山神社"],
    ["shijounawate","四条畷神社"],
    ["kitabatake","北畠神社"],
  ],

  "准勅祭十二社"=>
  [
    ["094nedu","根津神社"],
    ["000kanda","神田明神"],
    ["037kameido","亀戸天神社"],
    ["093shirayama","白山神社"],

    ["092ouji","王子神社"],
    ["064hie","日枝神社"],
    ["073shinagawa","品川神社"],
    ["077tomioka","富岡八幡宮"],

    ["063akasakahikawa","赤坂氷川神社"],
    ["059shibadai","芝大神宮"],
    ["208ookunitama","大國魂神社"],
    ["068washinomiya","鷲宮神社"],
  ],


  "坂東三十三箇所"=>
  [
    //["000","第一番札所<br>杉本寺"],
    //["000","第二番札所<br>岩殿寺"],
    //["000","第三番札所<br>安養院"],
    ["049hase","第一四番札所<br>長谷寺"],
    ["224shoufuku","第五番札所<br>勝福寺"],

    //["000","第六番札所<br>長谷寺"],
    //["000","第七番札所<br>光明寺"],
    //["000","第八番札所<br>星谷寺"],
    //["000","第九番札所<br>慈光寺"],
    //["000","第十番札所<br>正法寺"],

    //["000","第十一番札所<br>安楽寺"],
    //["000","第十二番札所<br>慈恩寺"],
    ["035sensou","第十三番札所<br>浅草寺"],
    ["354gumyou","第十四番札所<br>弘明寺"],
    //["000","第十五番札所<br>長谷寺"],

    //["000","第十六番札所<br>水澤寺"],
    //["000","第十七番札所<br>満願寺"],
    ["341chuuzen","第十八番札所<br>中禅寺"],
    ["339ooya","第十九番札所<br>大谷寺"],
    //["000","第廿番札所<br>西明寺"],

    //["000","第廿一番札所<br>日輪寺"],
    //["000","第廿二番札所<br>佐竹寺"],
    //["000","第廿三番札所<br>正福寺"],
    //["000","第廿四番札所<br>楽法寺"],
    ["125oomi","第廿五番札所<br>大御堂"],

    ["127kiyotaki","第廿六番札所<br>清瀧寺"],
    ["359iinuma","第廿七番札所<br>圓福寺"],
    //["000","第廿八番札所<br>龍正院"],
    ["099chibadera","第廿九番札所<br>千葉寺"],
    //["000","第丗番札所<br>高蔵寺"],

    ["153kasamori","第丗一番札所<br>笠森寺"],
    ["164kiyomizukannon","第丗二番札所<br>清水寺"],
    ["156nago","第丗三番札所<br>那古寺"],
  ],

  "西国三十三箇所"=>
  [
    ["371seiganto","第一番札所<br>青岸渡寺"],
    ["380kimii","第二番札所<br>紀三井寺"],
    ["386kokawa","第三番札所<br>粉河寺"],
    //["mimuroto","第十番札所<br>三室戸寺"],
    ["461daigo","第十一番札所<br>醍醐寺"],
    ["453ishiyama","第十三番札所<br>石山寺"],
    ["451onjoukannon","第十四番札所<br>園城寺観音堂"],

    ["397imakumanokannon","第十五番札所<br>今熊野観音寺"],
    ["406kiyomizu","第十六番札所<br>清水寺"],
    ["396rokuharamitsu","第十七番札所<br>六波羅蜜寺"],
    ["415chouhou","第十八番札所<br>頂法寺"],
    ["416gyougan","第十九番札所<br>行願寺"],
  ],


  "全国東照宮"=>
  [
    ["171sendaitou","仙台東照宮"],
    ["dewa","出羽三山神社"],
    ["148mitotou","水戸東照宮"],
    ["087nikkou","日光東照宮"],

    ["akagi","赤城神社"],
    ["216serada","世良田東照宮"],
    ["350senbatoushou","仙波東照宮"],
    ["204mitsumine","三峯神社"],

    ["205chichibu","秩父神社"],
    ["018ueno","上野東照宮"],
    ["036asakusa","浅草神社"],
    ["061shiba","芝東照宮"],

    ["059shibadai","芝大神宮"],
    ["208ookunitama","大國魂神社"],
    ["229kunousan","久能山東照宮"],
    ["228shizuokasengen","静岡浅間神社"],

    ["265gosha","五社神社"],
    ["292ozaki","尾崎神社"],
    ["sakae","佐佳枝廼社"],
    ["314hidatoushou","飛騨東照宮"],

    ["houraisantoushou","鳳来山東照宮"],
    ["tatsuki","龍城神社"],
    ["118matsudaira","松平東照宮"],
    ["108iga","伊賀八幡宮"],

    ["322nagoyatoushou","名古屋東照宮"],
    ["hiyoshitoushou","日吉東照宮"],
    ["382kishuutoushou","紀州東照宮"],
    ["hiroshimatoushou","広島東照宮"],
  ],


  // "全国護國神社"=>
  // [
  //   ["191miyagigokoku","宮城縣護國神社"],
  //   ["083ibarakigokoku","茨城縣護國神社"],
  //   ["202saitamagokoku","埼玉縣護國神社"],
  //   ["243yamanashigokoku","山梨縣護國神社"],
  //
  //   ["257niigatagokoku","新潟縣護國神社"],
  //   ["320aichigokoku","愛知縣護國神社"],
  //   ["311hidagokoku","飛騨護國神社"],
  //   ["304toyamagokoku","富山縣護國神社"],
  //
  //   ["290ishikawagokoku","石川護國神社"],
  //   ["284fukuigokoku","福井縣護國神社"],
  //   ["345miegokoku","三重縣護國神社"],
  //   ["388oosakagokoku","大阪護國神社"],
  //   ["407kyoutogokoku","京都霊山護國神社"],
  // ],


  // "全国総社"=>
  // [
  //   ["188mutsusousha","陸奥総社宮"],
  //   ["151hitachi","常陸国総社宮"],
  //   ["208ookunitama","大國魂神社"],
  //   ["222rokusho","六所神社"],
  //
  //   ["113kou","大国霊神社"],
  //   ["228shizuokasengen","静岡浅間神社"],
  //   ["271nanguuotabi","南宮御旅神社"],
  //   ["309hidasousha","飛騨総社"],
  // ],


  "全国国分寺"=>
  [
    ["174mutsukoku","陸奥国分寺"],
    ["140shimousa","下総国分寺"],
    ["004shinano","信濃国分寺"],
    ["312hidakokubun","飛騨国分寺"],
  ],



  // "000"=>
  // [
  //
  // ],

];
?>
