<?php
$all_group=[
  "東京五社"=>
  [
    ["025meiji","明治神宮"],
    ["023yasukuni","靖国神社"],
    ["064hie","日枝神社"],
    ["022toukyou","東京大神宮"],
    ["208ookunitama","大國魂神社"],
  ],


  "東京十社"=>
  [
    ["094nedu","根津神社"],
    ["000kanda","神田明神"],
    ["037kameido","亀戸天神社"],
    ["093shirayama","白山神社"],
    ["092ouji","王子神社"],

    ["064hie","日枝神社"],
    ["000shinagawa","品川神社"],
    ["077tomioka","富岡八幡宮"],
    ["063akasakahikawa","赤坂氷川神社"],
    ["059shibadai","芝大神宮"],
  ],


  "日蓮宗総本山＋四大本山"=>
  [
    ["233kuon","総本山<br>久遠寺"],
    ["131ikegami","大本山<br>池上本門寺"],
    ["000hokekyou","大本山<br>法華経寺"],
    ["160seichou","大本山<br>清澄寺"],
    ["162tanjou","大本山<br>誕生寺"],
  ],


  "南総四寺"=>
  [
    ["153kasamori","笠森寺"],
    ["154nihon","日本寺"],
    ["155gake","大福寺"],
    ["156nago","那古寺"],
  ],


  "五寺廻廊"=>
  [
    ["182chuuson","中尊寺"],
    ["186moutsuu","毛越寺"],
    ["178zuigan","瑞巌寺"],
    ["177entsuu","円通院"],
    ["000","立石寺"],
  ],


  "平泉"=>
  [
    ["184hiraizumishirayama","平泉寺"],
    ["182chuuson","中尊寺"],
    ["183konjiki","金色堂"],
    ["186moutsuu","毛越寺"],
    ["185gikei","義経堂"],
  ],


  "徳川四大菩提寺"=>
  [
    ["000kanei","寛永寺"],
    ["060zoujou","増上寺"],
    ["107daijuu","大樹寺"],
    ["119kougetsu","高月院"],
  ],

  "戦国菩提寺"=>
  [
    ["102banshou","織田氏<br>萬松寺"],
    ["245erin","武田氏<br>恵林寺"],
    ["260rinsen","上杉氏<br>林泉寺"],
    ["000","北条氏<br>早雲寺"],
  ],


  "鎌倉四寺"=>
  [
    ["040kenchou","建長寺"],
    ["041engaku","円覚寺"],
    ["199shoujoukou","清浄光寺"],
    ["000","光明寺"],
  ],


  "四大東照宮"=>
  [
    ["087nikkou","日光東照宮"],
    ["229kunousan","久能山東照宮"],
    ["018ueno","上野東照宮"],
    ["061shiba","芝東照宮"],
  ],

  "東国一宮"=>
  [
    #["000","蝦夷国一之宮<br>北海道神宮"],
    ["000","津軽国一之宮<br>岩木山神社"],
    ["181komagata","陸中国一之宮<br>駒形神社"],
    ["175shiogama","陸前国一之宮<br>鹽竈神社"],
    ["000","出羽国一之宮<br>大物忌神社吹浦口宮"],
    ["000","出羽国一之宮<br>大物忌神社蕨岡口宮"],

    ["000isasumi","岩代国一之宮<br>伊佐須美神社"],
    ["000","磐城国一之宮<br>都都古和気神社"],
    ["000","磐城国一之宮<br>都々古別神社"],
    ["000","磐城国一之宮<br>石都々古和気神社"],
    ["352nukisaki","上野国一之宮<br>貫前神社"],

    ["340futarasan","下野国一之宮<br>日光二荒山神社中宮祠"],
    ["088nikkoufutarasan","下野国一之宮<br>日光二荒山神社"],
    ["085utsunomiyafutarasan","下野国一之宮<br>宇都宮二荒山神社"],
    ["071kashima","常陸国一之宮<br>鹿島神宮"],
    ["069katori","下総国一之宮<br>香取神宮"],

    ["165tamasaki","上総国一之宮<br>玉前神社"],
    ["158awa","安房国一之宮<br>安房神社"],
    ["157susaki","安房国一之宮<br>洲崎神社"],
    ["038hikawa","武蔵国一之宮<br>氷川神社"],
    ["201hikawanyotai","武蔵国一之宮<br>氷川女體神社"],

    ["336ono","武蔵国一之宮<br>小野神社"],
    ["047tsurugaoka","相模国一之宮<br>鶴岡八幡宮"],
    ["196samukawa","相模国一之宮<br>寒川神社"],
    ["227mishima","伊豆国一之宮<br>三嶋大社"],
    ["205chichibu","知知夫国一之宮<br>秩父神社"],

    ["003suwa","信濃国一之宮<br>諏訪大社"],
    ["231sengen","甲斐国一之宮<br>浅間神社"],
    ["241yamanashisengen","駿河国一之宮<br>浅間大社"],
    ["264oguni","遠江国一之宮<br>小國神社"],
    ["263kotonomama","遠江国一之宮<br>事任八幡宮"],

    ["110toga","三河国一之宮<br>砥鹿神社"],
    ["114masumita","尾張国一之宮<br>真清田神社"],
    ["115oomiwa","尾張国一之宮<br>大神神社"],
    ["316minashi","飛騨国一之宮<br>水無神社"],
    ["268nanguu","美濃国一之宮<br>南宮大社"],

    ["301imizu","越中国一之宮<br>射水神社"],
    ["299ecchuuketa","越中国一之宮<br>氣多神社"],
    ["308takase","越中国一之宮<br>高瀬神社"],
    ["305oyamamae","越中国一之宮<br>雄山神社"],
    ["306oyamanaka","越中国一之宮<br>雄山神社"],

    ["273kehi","越前国一之宮<br>氣比神宮"],
    ["289shirayamahime","加賀国一之宮<br>白山比咩神社"],
    ["295keta","能登国一之宮<br>氣多大社"],
    ["275wakasahiko","若狭国一之宮<br>若狭彦神社"],
    ["000","佐渡国一之宮<br>度津神社"],

    ["258iyahiko","越後国一之宮<br>彌彦神社"],
    ["262kota","越後国一之宮<br>居多神社"],
    ["343tsubakinakara","伊勢国一之宮<br>都波岐奈加等神社"],
    ["349tsubaki","伊勢国一之宮<br>椿大神社"],
    ["348aekuni","伊賀国一之宮<br>敢国神社"],
  ],

  "愛知十社"=>
  [
    ["114masumita","尾張国一宮<br>真清田神社"],
    ["104ooagata","尾張国二宮<br>大縣神社"],
    ["027atsuta","尾張国三宮<br>熱田神宮"],
    ["115oomiwa","尾張国凖一宮<br>大神神社"],
    ["113kou","尾張国総社<br>大国霊神社"],

    ["110toga","三河国一宮<br>砥鹿神社"],
    ["111chiryuu","三河国二宮<br>知立神社"],
    ["117sanage","三河国三宮<br>猿投神社"],
    ["112tsushima","尾張五社<br>津島神社"],
    ["106haritsuna","尾張五社<br>針綱神社"],
  ],


  "茨城十二社"=>
  [
    ["071kashima","鹿島神宮"],
    ["084ooarai","大洗磯前神社"],
    ["145sakatsura","酒列磯前神社"],
    ["082kasama","笠間稲荷神社"],

    ["081tsukubasan","筑波山神社"],
    ["096oosugi","大杉神社"],
    ["083ibarakiken","茨城縣護国神社"],
    ["151hitachi","常陸國總社宮"],

    ["147mitohachiman","水戸八幡宮"],
    ["148mitotou","水戸東照宮"],
    ["149tokiwa","常磐神社"],
    ["146mitoyoshida","吉田神社"],
  ],

  "北陸二宮"=>
  [
    ["276wakasahime","若狭国二宮<br>若狭姫神社"],
    ["280tsurugi","越前国二宮<br>劔神社"],
    ["288sugouisobe","加賀国二宮<br>菅生石部神社"],
    ["298isurugihiko","能登国二宮<br>伊須流岐比古神社"],
    ["301imizu","越中国元二宮<br>射水神社"],
  ],


  "世界遺産浅間神社"=>
  [
    ["231sengen","浅間大社"],
    ["234yamamiyasengen","山宮浅間神社"],
    ["235murayamasengen","村山浅間神社"],
    ["236suyamasengen","須山浅間神社"],

    ["237higashiguchisengen","東口本宮浅間神社"],
    ["238kitaguchisengen","北口本宮浅間神社"],
    ["239mimurosengen","冨士御室浅間神社"],
    ["240kawaguchisengen","河口浅間神社"],
  ],


  "仙台六芒星"=>
  [
    ["167oosaki","大崎八幡宮"],
    ["170tsutsujigaoka","榴岡天満宮"],
    ["171sendaitou","仙台東照宮"],

    ["191miyagiken","宮城縣護國神社"],
    ["172aoba","青葉神社"],
    ["169sendaiatago","愛宕神社"],
  ],


  "鎌倉五山"=>
  [
    ["040kenchou","建長寺"],
    ["041engaku","円覚寺"],
    ["046jufuku","寿福寺"],
    ["042jouchi","浄智寺"],
    ["045joumyou","浄妙寺"],
  ],



  "京都五山"=>
  [
    ["009tenryuu","天龍寺"],
    ["000","相国寺"],
    ["000","建仁寺"],
    ["000","東福寺"],
    ["000","万寿寺"],
  ],

  "四大善光寺"=>
  [
    ["001zenkou","善光寺"],
    ["244kaizenkou","甲斐善光寺"],
    ["000","元善光寺"],
    ["116toukaizenkou","東海善光寺"],
  ],


  "浅草七福神"=>
  [
    ["035sensou","浅草寺"],
    ["036asakusa","浅草神社"],
    ["000","待乳山聖天"],
    ["034imado","今戸神社"],
    ["000","橋場不動院"],

    ["000","石浜神社"],
    ["032asakusaootori","鷲神社"],
    ["033yoshiwara","吉原神社"],
    ["029yasaki","矢先稲荷神社"],
  ],


  "日光二社一寺"=>
  [
    ["087nikkou","日光東照宮"],
    ["086rinnou","日光輪王寺"],
    ["088nikkoufutarasan","日光二荒山神社"],
    ["089daiyuu","大猷院"],
    ["090daiyuuinkinkaku","金閣殿"],
  ],


  "秩父四社"=>
  [
    ["205chichibu","秩父神社"],
    ["204mitsumine","三峯神社"],
    ["207hodosan","寶登山神社"],
    ["206imamiya","今宮神社"],
  ],


  "東国三社"=>
  [
    ["071kashima","鹿島神宮"],
    ["069katori","香取神宮"],
    ["070ikisu","息栖神社"],
  ],

  "西国三社"=>
  [
    // ["000","日前神宮・国懸神宮"],
    // ["000","竈山神社"],
    // ["000","伊太祁曽神社"],
  ],

  "三大弁財天"=>
  [
    ["000","都久夫須麻神社"],
    ["000","厳島神社"],
    ["197enoshima","江島神社"],
  ],

  "日本三大稲荷"=>
  [
    ["013fushimi","伏見稲荷大社"],
    ["000","祐徳稲荷神社"],
    ["082kasama","笠間稲荷神社"],
    ["000","最上稲荷"],
    ["109toyokawa","豊川稲荷"],
  ],


  "関東三大稲荷"=>
  [
    ["082kasama","笠間稲荷神社"],
    ["000","白笹稲荷神社"],
    ["091oujiinari","王子稲荷神社"],
    ["000","装束稲荷神社"],
  ],

  "日本三大八幡"=>
  [
    // 宇佐八幡宮
    // 石清水八幡宮
    // 筥崎宮
    // 鶴岡八幡宮
  ],

  "日本三大天神"=>
  [
    // 太宰府天満宮
    // 北野天満宮
    // 防府天満宮
  ],


  "関東三大天神"=>
  [
    ["019yushima","湯島天満宮"],
    ["037kameido","亀戸天神社"],
    ["209yabo","谷保天満宮"],
  ],


  "江戸三大天神"=>
  [
    ["019yushima","湯島天満宮"],
    ["037kameido","亀戸天神社"],
    ["065hirakawa","平河天満宮"],
    ["000gojou","五條天神社"],
  ],

  "日本三大住吉"=>
  [
    // 摂津国一宮<br>住吉大社
    // 長門国一宮<br>住吉神社
    // 筑前国一宮<br>住吉神社
  ],

  "江戸三名桜"=>
  [
    ["192konnou","金王八幡宮"],
    ["093shirayama","白山神社"],
    ["000","円照寺"],
  ],


  "江戸三大相撲"=>
  [
    ["000setagaya","世田谷八幡宮"],
    ["193shibuyahikawa","渋谷氷川神社"],
    ["220ooikashima","大井鹿嶋神社"],
  ],


  "五色不動"=>
  [
    ["072meguro","目黒不動<br>瀧泉寺"],
    ["249mejiro","目白不動<br>金乗院"],
    ["000","目赤不動<br>南谷寺"],

    ["000","目青不動<br>教学院"],
    ["000","目黄不動<br>永久寺"],
    ["000","目黄不動<br>最勝寺"],
  ],


  "関東厄除け三不動（天台宗）"=>
  [
    ["152chibayaku","千葉厄除け不動尊<br>妙泉寺"],
    ["072meguro","目黒不動尊<br>瀧泉寺"],
    ["000","飛不動尊<br>正宝院"],
  ],


  "関東三大不動（真言宗）"=>
  [
    ["051shinshou","成田不動尊<br>新勝寺"],
    ["210takahata","高幡不動尊<br>金剛寺"],
    ["219fudougaoka","不動ケ岡不動尊<br>總願寺"],
    ["000","大山不動尊<br>大山寺"],
  ],


  "関東厄除け三大師（真言宗・空海）"=>
  [
    ["000nishiarai","西新井大師<br>總持寺"],
    ["133kawasaki","川崎大師<br>平間寺"],
    ["000","観福寺大師堂"],
  ],


  "関東三大師（天台宗・良源）"=>
  [
    ["211sano","佐野厄除け大師<br>惣宗寺"],
    ["000","青柳大師<br>龍蔵寺"],
    ["331kawagoetaishi","川越大師<br>喜多院"],
    // ["000","拝島大師<br>本覚院"],
    ["212ashikaga","足利厄除け大師<br>龍泉寺"],
    ["195jindai","厄除け元三大師<br>深大寺"],
  ],


  "三大聖天"=>
  [
    ["218kangi","妻沼聖天<br>歓喜院"],
    ["000","待乳山聖天<br>本龍院"],
    ["000","生駒聖天<br>宝山寺"],
  ],


  "准勅祭十二社"=>
  [
    ["094nedu","根津神社"],
    ["000kanda","神田明神"],
    ["037kameido","亀戸天神社"],
    ["093shirayama","白山神社"],

    ["092ouji","王子神社"],
    ["064hie","日枝神社"],
    ["073shinagawa","品川神社"],
    ["077tomioka","富岡八幡宮"],

    ["063akasakahikawa","赤坂氷川神社"],
    ["059shibadai","芝大神宮"],
    ["208ookunitama","大國魂神社"],
    ["068washinomiya","鷲宮神社"],
  ],


  "平将門北斗七星"=>
  [
    ["000","鳥越神社"],
    ["121kabuto","兜神社"],
    ["000kanda","神田明神"],
    ["000","築土八幡神社"],

    ["000","水稲荷神社"],
    ["000yoroi","鎧神社"],
    ["000","築土神社"],
    ["000karasumori","烏森神社"],
  ],


  "三大輪王寺"=>
  [
    ["086rinnou","日光輪王寺"],
    ["015uenorinnou","上野輪王寺"],
    ["173sendairinnou","仙台輪王寺"],
  ],


  "天下三戒壇"=>
  [
    ["000","東大寺"],
    ["000","観世音寺"],
    ["338shimotsukeyakushi","下野薬師寺"],
  ],


  "日本三大仏"=>
  [
    ["000","奈良大仏"],
    ["050koutoku","鎌倉大仏"],
    ["302takaoka","高岡大仏"],
  ],


  "三長三本"=>
  [
    ["131ikegami","長栄山本門寺"],
    ["000","長興山妙本寺"],
    ["254hondo","長谷山本土寺"],
  ],


  "箱根三社"=>
  [
    ["225hakone","箱根神社"],
    ["226kuzuryuu","九頭龍神社"],
    ["000","箱根元宮"],
  ],


  "成田山別院"=>
  [
    ["051shinshou","成田山新勝寺"],
    ["078fukagawa","東京別院<br>深川不動尊"],
    ["332kawagoenarita","川越別院<br>本行院"],
    ["000","札幌別院<br>新栄寺"],
    ["136yokohamanarita","横浜別院<br>延命院"],

    ["000","函館別院<br>函館寺"],
    ["000","大阪別院<br>明王院"],
    ["105inuyamanarita","名古屋別院<br>大聖寺"],
    ["000","福井別院<br>九頭龍寺"],
  ],


  "日蓮四大法難"=>
  [
    ["159kyounin","小松原法難<br>鏡忍寺"],
    ["000","松葉ヶ谷法難<br>本圀寺"],
    ["198ryuukuchi","龍ノ口法難<br>龍口寺"],
    ["000","伊豆法難<br>佛現寺"],
  ],


  "江戸六塔"=>
  [
    ["000kanei","寛永寺"],
    ["060zoujou","増上寺"],
    ["035sensou","浅草寺"],

    ["131ikegami","池上本門寺"],
    ["000housen","宝仙寺"],
    ["000","天王寺"],

  ],


  "真言宗智山派大本山＋別格本山"=>
  [
    ["051shinshou","大本山<br>成田山新勝寺"],
    ["133kawasaki","大本山<br>川崎大師平間寺"],
    ["337yakuou","大本山<br>高尾山薬王院"],
    ["210takahata","別格本山<br>高幡不動金剛寺"],
    ["101oosu","別格本山<br>大須観音宝生院"],
  ],


  "浄土宗総本山＋七大本山"=>
  [
    ["000","総本山<br>知恩院"],
    ["060zoujou","大本山<br>増上寺"],
    ["000","大本山<br>光明寺"],
    ["001zenkou","大本山<br>善光寺"],

    ["000","大本山<br>金戒光明寺"],
    ["000","大本山<br>知恩寺"],
    ["000","大本山<br>清浄華院"],
    ["000","大本山<br>善導寺"],
  ],


  "日蓮宗総本山＋七大本山"=>
  [
    ["233kuon","総本山<br>久遠寺"],
    ["162tanjou","大本山<br>誕生寺"],
    ["160seichou","大本山<br>清澄寺"],
    ["000hokekyou","大本山<br>法華経寺"],

    ["232kitayamahonmon","大本山<br>北山本門寺"],
    ["131ikegami","大本山<br>池上本門寺"],
    ["000","大本山<br>妙顕寺"],
    ["000","大本山<br>本圀寺"],
  ],


  "臨済宗九大本山"=>
  [
    ["000","大本山<br>南禅寺"],
    ["009tenryuu","大本山<br>天龍寺"],
    ["000","大本山<br>相国寺"],
    ["000","大本山<br>建仁寺"],
    ["000","大本山<br>東福寺"],

    ["000","大本山<br>大徳寺"],
    ["000","大本山<br>妙心寺"],
    ["040kenchou","大本山<br>建長寺"],
    ["041engaku","大本山<br>円覚寺"],
  ],


  "曹洞宗三大本山"=>
  [
    ["285eihei","大本山<br>永平寺"],
    ["134souji","大本山<br>総持寺"],
    ["180shoubou","旧大本山<br>正法寺"],
  ],


  "建武中興十五社"=>
  [
    ["000","吉野神宮"],
    ["044kamakura","鎌倉宮"],
    ["266iinoya","井伊谷宮"],
    ["000","八代宮"],
    ["274kanegasaki","金崎宮"],

    ["097komikado","小御門神社"],
    ["000","菊池神社"],
    ["000","湊川神社"],
    ["000","名和神社"],
    ["000","阿倍野神社"],

    ["000","藤島神社"],
    ["347yuuki","結城神社"],
    ["000","霊山神社"],
    ["000","四条畷神社"],
    ["000","北畠神社"],
  ],


  "坂東三十三箇所"=>
  [
    ["000","杉本寺"],
    ["000","岩殿寺"],
    ["000","安養院"],
    ["049hase","長谷寺"],
    ["224shoufuku","勝福寺"],

    ["000","長谷寺"],
    ["000","光明寺"],
    ["000","星谷寺"],
    ["000","慈光寺"],
    ["000","正法寺"],

    ["000","安楽寺"],
    ["000","慈恩寺"],
    ["035sensou","浅草寺"],
    ["354gumyou","弘明寺"],
    ["000","長谷寺"],

    ["000","水澤寺"],
    ["000","満願寺"],
    ["341chuuzen","中禅寺"],
    ["339ooya","大谷寺"],
    ["000","西明寺"],

    ["000","日輪寺"],
    ["000","佐竹寺"],
    ["000","正福寺"],
    ["000","楽法寺"],
    ["125oomi","大御堂"],

    ["127kiyotaki","清瀧寺"],
    ["000","圓福寺"],
    ["000","龍正院"],
    ["099chibadera","千葉寺"],
    ["000","高蔵寺"],

    ["153kasamori","笠森寺"],
    ["164kiyomizukannon","清水寺"],
    ["156nago","那古寺"],
  ],


  "全国東照宮"=>
  [
    ["171sendaitou","仙台東照宮"],
    ["000","出羽三山神社"],
    ["148mitotou","水戸東照宮"],
    ["087nikkou","日光東照宮"],

    ["000","赤城神社"],
    ["216serada","世良田東照宮"],
    ["350senbatoushou","仙波東照宮"],
    ["204mitsumine","三峯神社"],

    ["205chichibu","秩父神社"],
    ["018ueno","上野東照宮"],
    ["036asakusa","浅草神社"],
    ["061shiba","芝東照宮"],

    ["059shibadai","芝大神宮"],
    ["208ookunitama","大國魂神社"],
    ["229kunousan","久能山東照宮"],
    ["228shizuokasengen","静岡浅間神社"],

    ["265gosha","五社神社"],
    ["292ozaki","尾崎神社"],
    ["000","佐佳枝廼社"],
    ["314hidatoushou","飛騨東照宮"],

    ["000","鳳来山東照宮"],
    ["000","龍城神社"],
    ["118matsudaira","松平東照宮"],
    ["108iga","伊賀八幡宮"],

    ["322nagoyatoushou","名古屋東照宮"],
    ["000","日吉東照宮"],
    ["000","紀州東照宮"],
    ["000","広島東照宮"],
  ],


  "全国護國神社"=>
  [
    ["191miyagiken","宮城縣護國神社"],
    ["083ibarakiken","茨城縣護國神社"],
    ["202saitamaken","埼玉縣護國神社"],
    ["243yamanashiken","山梨縣護國神社"],

    ["257niigataken","新潟縣護國神社"],
    ["320aichiken","愛知縣護國神社"],
    ["311hidagokoku","飛騨護國神社"],
    ["304toyamaken","富山縣護國神社"],

    ["290ishikawaken","石川護國神社"],
    ["284fukuiken","福井縣護國神社"],
    ["345mieken","三重縣護國神社"],
  ],


  "全国総社"=>
  [
    ["188mutsusousha","陸奥総社宮"],
    ["151hitachi","常陸国総社宮"],
    ["208ookunitama","大國魂神社"],
    ["222rokusho","六所神社"],

    ["113kou","大国霊神社"],
    ["228shizuokasengen","静岡浅間神社"],
    ["271nanguuotabi","南宮御旅神社"],
    ["309hidasousha","飛騨総社"],
  ],


  "全国国分寺"=>
  [
    ["174mutsukoku","陸奥国分寺"],
    ["140shimousa","下総国分寺"],
    ["004shinano","信濃国分寺"],
    ["312hidakokubun","飛騨国分寺"],
  ],

  "日蓮宗五重塔"=>
  [
    ["","久遠寺"],
    ["","法華経寺"],
    ["","北山本門寺"],
    ["","池上本門寺"],

    ["","龍口寺"],
    ["","妙成寺"],
    ["","妙宣寺"],

  ],

  // ""=>
  // [
  //
  // ],

];
?>
